{
  "title": "Know the mission, vision and core values of NU Curations",
  "date": "2024-02-18T09:45:06+07:00",
  "image": "images/blog/how-to-effectively-work-with-interior-designer/pexels-spencer-davis-4400026.jpg",
  "feature_image": "images/blog/how-to-effectively-work-with-interior-designer/pexels-spacex-586082.jpg",
  "author": "Neha Gupta",
  "content": {
    "intro": "NU Curations exists to make every space feel like home, transforming interior design into a warm embrace of comfort, style, and community. Our vision is to create spaces that feel like home, impacting individuals by fostering comfort, connection, and inspiration through thoughtful design. NU Curations provides warm and welcoming interior design solutions that value comfort, creativity, and connection. We achieve this by prioritizing your needs, building trust like old friends, and infusing every project with creativity and care.",
    "core_values": [
      {
        "value": "Putting You First",
        "description": "We're here to ensure your happiness comes first, making every step of your design journey seamless and enjoyable."
      },
      {
        "value": "Trustworthy Friendship",
        "description": "We're more than just designers; we're your trusted friends, guiding you through the process with warmth, understanding, and affordability."
      },
      {
        "value": "Pursuit of Excellence",
        "description": "We pour our hearts into every project, treating each one as a masterpiece, crafted with love and attention to detail."
      },
      {
        "value": "Unleashing Creativity",
        "description": "We believe in the power of boundless creativity, unlocking new possibilities to make your space truly yours."
      },
      {
        "value": "Empowering Communities",
        "description": "We believe in building stronger, happier communities by empowering individuals through design, promoting well-being and a sense of belonging."
      }
    ],
    "quote": "Neha Gupta"
  }
}
